import smtplib
from email.mime.text import MIMEText
from email.header import Header
from email.mime.text import MIMEText
from email.utils import formataddr
import time
import json
import pandas as pd
from datetime import datetime, timedelta
def daysAgo(inDate, days):
    oneyearago = datetime.strptime(inDate, '%Y-%m-%d') - timedelta(days=days)
    oneyearago = oneyearago.strftime('%Y-%m-%d')
    return oneyearago

def hangyeRead():
    df_industry=pd.read_csv('./data/stock_industry.csv')
    df_industry = df_industry[['code','code_name','industry']]
    industry_dic = {}
    for item in df_industry.values:
        industry_dic[item[0]] = item[1:3]

    return industry_dic

def getSTR():
    with open('./data2/out.json', 'r') as f:
        trade_list = json.load(fp=f)

    localtime = time.strftime("%Y-%m-%d", time.localtime())
    industry_dic = hangyeRead()
    send = []
    outStr = "代码 , 收盘日期 , 收盘价格 , 明日预测买卖方向 , 指标（越大越好), 股票名字, 所属板块\n"
    for item in trade_list:
        if daysAgo(localtime, 0) == item[1]:
            item += [industry_dic[item[0]][0], industry_dic[item[0]][1]]
            outStr += str(item)
            outStr += '\n' 
    outStr += "注意事项：\n \
                1.上午最佳卖出是早上开盘一冲高和11：00左右 (大盘高开10点前卖，低开等反弹在卖)。\n\
                2.上午最佳买入是大盘低开和10：00-10：30分左右。\n\
                3.下午最佳买入是2：00-2：30大家注意观察。\n\
                4.下午最佳卖出是13：10分-13：30分。\n\
                一定把我的这个邮箱设置为联系人，否则会进入到垃圾箱\
              "
    return outStr

def email(dstEmail, outStr):
    sender = '814123206@qq.com'
    localtime = time.strftime("%Y-%m-%d", time.localtime())
    smtp = smtplib.SMTP() 
    smtp.connect('smtp.qq.com',25) 
    smtp.login(sender, 'cyntatcmjvojbbdj') 

    msg=MIMEText(outStr,'plain','utf-8')
    msg['From']=formataddr(['魏旭鸿',sender])
    msg['To']=formataddr([dstEmail,dstEmail])
    msg['Subject']='在' + daysAgo(localtime, -1) + 'Asotck的操作'

    smtp.sendmail(sender, dstEmail, msg.as_string()) 
    smtp.quit()


if __name__ == "__main__":
    outStr = \
    '''
    中信证券 非银金融 203.0 亿,价格处于高位的 40.0 % 当前价格20.94,最低买入13.65,更低买入12.97,稍高买入14.33 回归价格:14.89~18.62~22.34 股息率1.91%,2018

国投资本 非银金融 46.0 亿,价格处于高位的 39.0 % 当前价格13.38,最低买入7.49,更低买入7.11,稍高买入7.86 回归价格:10.44~13.05~15.66 股息率0.61%,2019

国金证券 非银金融 23.0 亿,价格处于高位的 40.0 % 当前价格9.22,最低买入5.85,更低买入5.56,稍高买入6.14 回归价格:7.45~9.31~11.17 股息率0.43%,2019

西水股份 非银金融 27.0 亿,价格处于高位的 8.0 % 当前价格10.10,最低买入1.33,更低买入1.26,稍高买入1.40 回归价格:12.38~15.48~18.57 股息率0.30%,2018

西南证券 非银金融 35.0 亿,价格处于高位的 35.0 % 当前价格4.72,最低买入1.53,更低买入1.45,稍高买入1.60 回归价格:2.85~3.56~4.28 股息率1.06%,2018

爱建集团 非银金融 11.0 亿,价格处于高位的 -0.0 % 当前价格9.16,最低买入9.16,更低买入8.71,稍高买入9.62 回归价格:14.40~18.01~21.61 股息率1.31%,2019

中航资本 非银金融 39.0 亿,价格处于高位的 21.0 % 当前价格5.32,最低买入4.17,更低买入3.96,稍高买入4.37 回归价格:5.26~6.58~7.90 股息率1.03%,2018

海通证券 非银金融 168.0 亿,价格处于高位的 36.0 % 当前价格12.84,最低买入7.36,更低买入6.99,稍高买入7.73 回归价格:9.87~12.33~14.80 股息率1.79%,2018

江苏租赁 非银金融 209.0 亿,价格处于高位的 1.0 % 当前价格6.12,最低买入5.95,更低买入5.65,稍高买入6.24 回归价格:6.57~8.22~9.86 股息率3.27%,2019

华安证券 非银金融 118.0 亿,价格处于高位的 1.0 % 当前价格6.23,最低买入6.04,更低买入5.74,稍高买入6.34 回归价格:8.73~10.91~13.09 股息率0.96%,2019

东方证券 非银金融 103.0 亿,价格处于高位的 28.0 % 当前价格10.30,最低买入5.32,更低买入5.05,稍高买入5.59 回归价格:8.14~10.18~12.21 股息率1.94%,2018

招商证券 非银金融 109.0 亿,价格处于高位的 28.0 % 当前价格15.65,最低买入12.54,更低买入11.92,稍高买入13.17 回归价格:13.48~16.85~20.22 股息率2.21%,2018

中信建投 非银金融 31.0 亿,价格处于高位的 47.0 % 当前价格20.71,最低买入6.08,更低买入5.77,稍高买入6.38 回归价格:12.40~15.50~18.60 股息率0.87%,2018

财通证券 非银金融 14.0 亿,价格处于高位的 78.0 % 当前价格10.91,最低买入3.01,更低买入2.86,稍高买入3.16 回归价格:5.49~6.87~8.24 股息率1.65%,2018

天风证券 非银金融 37.0 亿,价格处于高位的 83.0 % 当前价格9.93,最低买入0.88,更低买入0.84,稍高买入0.93 回归价格:2.47~3.09~3.71 股息率0.07%,2019

东兴证券 非银金融 67.0 亿,价格处于高位的 25.0 % 当前价格11.68,最低买入8.13,更低买入7.72,稍高买入8.53 回归价格:12.15~15.18~18.22 股息率1.28%,2018

国泰君安 非银金融 166.0 亿,价格处于高位的 43.0 % 当前价格16.41,最低买入10.50,更低买入9.98,稍高买入11.03 回归价格:11.71~14.64~17.56 股息率2.44%,2018

中国平安 非银金融 1204.0 亿,价格处于高位的 21.0 % 当前价格84.03,最低买入69.12,更低买入65.66,稍高买入72.57 回归价格:74.12~92.65~111.18 股息率1.31%,2019

新华保险 非银金融 86.0 亿,价格处于高位的 10.0 % 当前价格51.16,最低买入42.72,更低买入40.58,稍高买入44.85 回归价格:61.79~77.24~92.68 股息率1.02%,2018

中原证券 非银金融 14.0 亿,价格处于高位的 29.0 % 当前价格5.06,最低买入1.11,更低买入1.06,稍高买入1.17 回归价格:2.13~2.67~3.20 股息率0.69%,2018

兴业证券 非银金融 44.0 亿,价格处于高位的 10.0 % 当前价格6.28,最低买入1.77,更低买入1.68,稍高买入1.86 回归价格:3.32~4.15~4.98 股息率2.39%,2018

东吴证券 非银金融 1293.0 亿,价格处于高位的 5.0 % 当前价格9.93,最低买入6.72,更低买入6.38,稍高买入7.05 回归价格:13.01~16.26~19.51 股息率1.51%,2018

中国太保 非银金融 184.0 亿,价格处于高位的 7.0 % 当前价格35.00,最低买入32.25,更低买入30.64,稍高买入33.86 回归价格:37.57~46.97~56.36 股息率2.29%,2018

中国人寿 非银金融 351.0 亿,价格处于高位的 25.0 % 当前价格26.75,最低买入13.07,更低买入12.42,稍高买入13.72 回归价格:21.32~26.65~31.98 股息率0.60%,2019

华泰证券 非银金融 107.0 亿,价格处于高位的 58.0 % 当前价格19.46,最低买入7.44,更低买入7.07,稍高买入7.82 回归价格:10.91~13.63~16.36 股息率1.54%,2018

光大证券 非银金融 77.0 亿,价格处于高位的 9.0 % 当前价格10.69,最低买入1.97,更低买入1.88,稍高买入2.07 回归价格:5.47~6.84~8.21 股息率1.87%,2018

浙商证券 非银金融 26.0 亿,价格处于高位的 45.0 % 当前价格9.07,最低买入3.73,更低买入3.55,稍高买入3.92 回归价格:7.28~9.10~10.92 股息率0.77%,2019

中国银河 非银金融 51.0 亿,价格处于高位的 24.0 % 当前价格10.99,最低买入5.67,更低买入5.39,稍高买入5.96 回归价格:7.78~9.72~11.67 股息率0.82%,2019

方正证券 非银金融 57.0 亿,价格处于高位的 39.0 % 当前价格7.01,最低买入2.53,更低买入2.40,稍高买入2.65 回归价格:4.78~5.98~7.18 股息率0.14%,2018

申万宏源 非银金融 124.0 亿,价格处于高位的 47.0 % 当前价格4.83,最低买入3.10,更低买入2.95,稍高买入3.26 回归价格:3.69~4.62~5.54 股息率1.04%,2019

渤海租赁 非银金融 31.0 亿,价格处于高位的 6.0 % 当前价格3.87,最低买入3.23,更低买入3.07,稍高买入3.39 回归价格:5.39~6.73~8.08 股息率1.55%,2018

天茂集团 非银金融 31.0 亿,价格处于高位的 34.0 % 当前价格6.46,最低买入4.33,更低买入4.11,稍高买入4.54 回归价格:5.19~6.48~7.78 股息率0.15%,2018

经纬纺机 非银金融 29.0 亿,价格处于高位的 7.0 % 当前价格12.63,最低买入9.64,更低买入9.16,稍高买入10.12 回归价格:16.01~20.01~24.01 股息率1.66%,2018

东北证券 非银金融 26.0 亿,价格处于高位的 11.0 % 当前价格8.44,最低买入5.87,更低买入5.58,稍高买入6.16 回归价格:8.25~10.31~12.38 股息率1.18%,2018

国元证券 非银金融 27.0 亿,价格处于高位的 31.0 % 当前价格9.07,最低买入5.84,更低买入5.54,稍高买入6.13 回归价格:6.83~8.53~10.24 股息率1.65%,2018

国海证券 非银金融 18.0 亿,价格处于高位的 26.0 % 当前价格4.99,最低买入0.88,更低买入0.83,稍高买入0.92 回归价格:2.47~3.09~3.71 股息率0.40%,2019

广发证券 非银金融 136.0 亿,价格处于高位的 29.0 % 当前价格12.89,最低买入8.82,更低买入8.38,稍高买入9.26 回归价格:9.70~12.12~14.54 股息率3.10%,2018

长江证券 非银金融 34.0 亿,价格处于高位的 23.0 % 当前价格7.20,最低买入2.57,更低买入2.44,稍高买入2.70 回归价格:4.21~5.27~6.32 股息率2.08%,2018

山西证券 非银金融 14.0 亿,价格处于高位的 14.0 % 当前价格8.03,最低买入5.49,更低买入5.21,稍高买入5.76 回归价格:7.96~9.94~11.93 股息率1.12%,2018

西部证券 非银金融 19.0 亿,价格处于高位的 12.0 % 当前价格10.04,最低买入5.86,更低买入5.57,稍高买入6.16 回归价格:8.95~11.19~13.43 股息率0.70%,2018

国信证券 非银金融 139.0 亿,价格处于高位的 29.0 % 当前价格11.96,最低买入8.44,更低买入8.02,稍高买入8.86 回归价格:10.36~12.96~15.55 股息率1.00%,2019
'''

    # outStr += "注意事项：\n \
    #             以上股票随便买，都是低估值，有钱就买，越便宜越买\
    #             1.上午最佳卖出是早上开盘一冲高和11：00左右 (大盘高开10点前卖，低开等反弹在卖)。\n\
    #             2.上午最佳买入是大盘低开和10：00-10：30分左右。\n\
    #             3.下午最佳买入是2：00-2：30大家注意观察。\n\
    #             4.下午最佳卖出是13：10分-13：30分。\n\
    #             \
    #           "
    sendlist = ['big_weixuhong@qq.com', 'qiujtmaric@163.com']
    # ,'719253612@qq.com', 'qiujtmaric@163.com','sunyixin610@126.com','364141009@qq.com','whitekreuz@163.com',\
    #            'zzhisheng@outlook.com', 'qiujtmaric@163.com']
    print(outStr)
    for item in sendlist:
        email(item, outStr)
        print(item, '   go')
    # try:
        
    # except as e :
        # print(e)
        # print('send failed', item)