import smtplib
from email.mime.text import MIMEText
from email.header import Header
from email.mime.text import MIMEText
from email.utils import formataddr
import time
import json
import pandas as pd
from datetime import datetime, timedelta
def daysAgo(inDate, days):
    oneyearago = datetime.strptime(inDate, '%Y-%m-%d') - timedelta(days=days)
    oneyearago = oneyearago.strftime('%Y-%m-%d')
    return oneyearago

def hangyeRead():
    df_industry=pd.read_csv('./data/stock_industry.csv')
    df_industry = df_industry[['code','code_name','industry']]
    industry_dic = {}
    for item in df_industry.values:
        industry_dic[item[0]] = item[1:3]

    return industry_dic

def getSTR():
    with open('./data2/out.json', 'r') as f:
        trade_list = json.load(fp=f)

    localtime = time.strftime("%Y-%m-%d", time.localtime())
    industry_dic = hangyeRead()
    send = []
    outStr = "代码 , 收盘日期 , 收盘价格 , 明日预测买卖方向 , 指标（越大越好), 股票名字, 所属板块\n"
    for item in trade_list:
        if daysAgo(localtime, 0) == item[1]:
            item += [industry_dic[item[0]][0], industry_dic[item[0]][1]]
            outStr += str(item)
            outStr += '\n' 
    outStr += "注意事项：\n \
                1.上午最佳卖出是早上开盘一冲高和11：00左右 (大盘高开10点前卖，低开等反弹在卖)。\n\
                2.上午最佳买入是大盘低开和10：00-10：30分左右。\n\
                3.下午最佳买入是2：00-2：30大家注意观察。\n\
                4.下午最佳卖出是13：10分-13：30分。\n\
                一定把我的这个邮箱设置为联系人，否则会进入到垃圾箱\
              "
    return outStr

def email(dstEmail, outStr):
    sender = '814123206@qq.com'
    localtime = time.strftime("%Y-%m-%d", time.localtime())
    smtp = smtplib.SMTP() 
    smtp.connect('smtp.qq.com',25) 
    smtp.login(sender, 'cyntatcmjvojbbdj') 

    msg=MIMEText(outStr,'plain','utf-8')
    msg['From']=formataddr(['魏旭鸿',sender])
    msg['To']=formataddr([dstEmail,dstEmail])
    msg['Subject']='在' + daysAgo(localtime, -1) + 'Asotck的操作'

    smtp.sendmail(sender, dstEmail, msg.as_string()) 
    smtp.quit()


if __name__ == "__main__":
    outStr = \
    '''
房地产"利"需要大于100亿
沪深300 pe12:1%,pe11.75:+1.5%,pe11.5:+1.5%,pe11.2:+1%
-------------------------------
 1- 1 成长27% 口子窖 食品饮料 利153亿 攻89.24% 防104.83%  现价53.60￥ 股息率2.80% pe=19.07 PEG=0.68 m_ROE=22.83%
口子窖 食品饮料 153.0 亿利润, 估值区间:27.54 %    当前价格<2020-01-03:53.60元>,
买入估值参考: [39.71 41.1  42.49]
买入价格参考: [48.9  50.61 52.32]
买入平均参考: [45.22 46.8  48.39]
4年平均杜邦ROE 22.83%
当前PE(B)TTM=19.07,预计PE(B)=25.65, peg:0.68
股息率2.80%,上次分红日期:2019-05-28
-6%捡建:45.49￥,-3%捡建:46.94￥,0%捡建:48.39￥,+3%捡建:49.84￥,+7.5%捡建:52.02￥, 当前涨幅10.76%
防御力(越大越好,优质股基准为90%):104.83%

-------------------------------
 2- 1 成长25% 白云山 医药生物 利353亿 攻91.07% 防152.47%  现价35.05￥ 股息率1.21% pe=18.03 PEG=0.72 m_ROE=14.03%
白云山 医药生物 353.0 亿利润, 估值区间:6.81 %    当前价格<2020-01-03:35.05元>,
买入估值参考: [26.24 27.16 28.08]
买入价格参考: [32.61 33.76 34.9 ]
买入平均参考: [30.07 31.12 32.17]
4年平均杜邦ROE 14.03%
当前PE(B)TTM=18.03,预计PE(B)=64.00, peg:0.72
股息率1.21%,上次分红日期:2019-07-10
-6%捡建:30.25￥,-3%捡建:31.21￥,0%捡建:32.18￥,+3%捡建:33.14￥,+7.5%捡建:34.59￥, 当前涨幅8.93%
防御力(越大越好,优质股基准为90%):152.47%
可以关注买入
 2- 2 成长26% 华东医药 医药生物 利239亿 攻98.20% 防101.26%  现价24.53￥ 股息率1.35% pe=16.07 PEG=0.61 m_ROE=29.39%
华东医药 医药生物 239.0 亿利润, 估值区间:4.66 %    当前价格<2020-01-03:24.53元>,
买入估值参考: [22.52 23.3  24.09]
买入价格参考: [22.52 23.3  24.09]
买入平均参考: [22.52 23.3  24.09]
4年平均杜邦ROE 29.39%
当前PE(B)TTM=16.07,预计PE(B)=34.41, peg:0.61
股息率1.35%,上次分红日期:2019-06-20
-6%捡建:22.65￥,-3%捡建:23.37￥,0%捡建:24.10￥,+3%捡建:24.82￥,+7.5%捡建:25.90￥, 当前涨幅1.80%
防御力(越大越好,优质股基准为90%):101.26%
可以关注买入
 2- 3 成长08% 华润三九 医药生物 利198亿 攻91.84% 防69.75%  现价31.34￥ 股息率1.24% pe=13.40 PEG=1.56 m_ROE=15.05%
华润三九 医药生物 198.0 亿利润, 估值区间:8.59 %    当前价格<2020-01-03:31.34元>,
买入估值参考: [26.37 27.29 28.21]
买入价格参考: [27.55 28.51 29.47]
买入平均参考: [27.07 28.02 28.97]
4年平均杜邦ROE 15.05%
当前PE(B)TTM=13.40,预计PE(B)=28.80, peg:1.56
股息率1.24%,上次分红日期:2019-08-07
-6%捡建:27.24￥,-3%捡建:28.11￥,0%捡建:28.97￥,+3%捡建:29.84￥,+7.5%捡建:31.15￥, 当前涨幅8.16%
防御力(越大越好,优质股基准为90%):69.75%
可以关注买入
 2- 4 成长25% 鱼跃医疗 医药生物 利75亿 攻98.18% 防64.24%  现价20.33￥ 股息率0.74% pe=25.10 PEG=0.98 m_ROE=14.58%
鱼跃医疗 医药生物 75.0 亿利润, 估值区间:3.62 %    当前价格<2020-01-03:20.33元>,
买入估值参考: [18.66 19.31 19.96]
买入价格参考: [18.66 19.31 19.96]
买入平均参考: [18.66 19.31 19.96]
4年平均杜邦ROE 14.58%
当前PE(B)TTM=25.10,预计PE(B)=64.00, peg:0.98
股息率0.74%,上次分红日期:2019-05-30
-6%捡建:18.77￥,-3%捡建:19.37￥,0%捡建:19.97￥,+3%捡建:20.57￥,+7.5%捡建:21.46￥, 当前涨幅1.82%
防御力(越大越好,优质股基准为90%):64.24%
可以关注买入
 2- 5 成长17% 仁和药业 医药生物 利58亿 攻97.28% 防140.74%  现价6.35￥ 股息率1.57% pe=14.21 PEG=0.83 m_ROE=15.30%
仁和药业 医药生物 58.0 亿利润, 估值区间:2.86 %    当前价格<2020-01-03:6.35元>,
买入估值参考: [5.66 5.86 6.06]
买入价格参考: [5.85 6.05 6.25]
买入平均参考: [5.77 5.97 6.18]
4年平均杜邦ROE 15.30%
当前PE(B)TTM=14.21,预计PE(B)=52.82, peg:0.83
股息率1.57%,上次分红日期:2019-06-12
-6%捡建:5.81￥,-3%捡建:6.00￥,0%捡建:6.18￥,+3%捡建:6.37￥,+7.5%捡建:6.65￥, 当前涨幅2.72%
防御力(越大越好,优质股基准为90%):140.74%
可以关注买入
 2- 6 成长21% 老百姓 医药生物 利50亿 攻89.22% 防119.34%  现价66.12￥ 股息率0.76% pe=37.56 PEG=1.74 m_ROE=14.94%
老百姓 医药生物 50.0 亿利润, 估值区间:23.29 %    当前价格<2020-01-03:66.12元>,
买入估值参考: [53.24 55.1  56.97]
买入价格参考: [57.47 59.48 61.49]
买入平均参考: [55.78 57.73 59.68]
4年平均杜邦ROE 14.94%
当前PE(B)TTM=37.56,预计PE(B)=49.32, peg:1.74
股息率0.76%,上次分红日期:2019-07-19
-6%捡建:56.10￥,-3%捡建:57.89￥,0%捡建:59.68￥,+3%捡建:61.48￥,+7.5%捡建:64.16￥, 当前涨幅10.78%
防御力(越大越好,优质股基准为90%):119.34%

 2- 7 成长14% 江中药业 医药生物 利47亿 攻97.57% 防38.69%  现价12.66￥ 股息率2.76% pe=13.34 PEG=0.91 m_ROE=15.55%
江中药业 医药生物 47.0 亿利润, 估值区间:2.30 %    当前价格<2020-01-03:12.66元>,
买入估值参考: [11.79 12.2  12.61]
买入价格参考: [11.39 11.78 12.18]
买入平均参考: [11.55 11.95 12.35]
4年平均杜邦ROE 15.55%
当前PE(B)TTM=13.34,预计PE(B)=41.78, peg:0.91
股息率2.76%,上次分红日期:2019-06-11
-6%捡建:11.62￥,-3%捡建:11.99￥,0%捡建:12.36￥,+3%捡建:12.73￥,+7.5%捡建:13.29￥, 当前涨幅2.43%
防御力(越大越好,优质股基准为90%):38.69%
可以关注买入
-------------------------------
 3- 1 成长25% 浙江美大 家用电器 利37亿 攻96.42% 防44.35%  现价13.43￥ 股息率3.46% pe=19.96 PEG=0.77 m_ROE=21.71%
浙江美大 家用电器 37.0 亿利润, 估值区间:4.26 %    当前价格<2020-01-03:13.43元>,
买入估值参考: [11.63 12.04 12.44]
买入价格参考: [12.44 12.87 13.31]
买入平均参考: [12.11 12.54 12.96]
4年平均杜邦ROE 21.71%
当前PE(B)TTM=19.96,预计PE(B)=64.00, peg:0.77
股息率3.46%,上次分红日期:2019-04-23
-6%捡建:12.19￥,-3%捡建:12.58￥,0%捡建:12.97￥,+3%捡建:13.35￥,+7.5%捡建:13.94￥, 当前涨幅3.58%
防御力(越大越好,优质股基准为90%):44.35%
可以关注买入
'''
    outStr = """注意事项：\n \
建仓价格参考
""" \
              + outStr

    sendlist = ['big_weixuhong@qq.com']
    # , 'qiujtmaric@163.com','719253612@qq.com'\
    # ,'sunyixin610@126.com','364141009@qq.com','whitekreuz@163.com',\
    #            'zzhisheng@outlook.com','chenyf_sh@163.com', 'zhao129363@163.com','675988851@qq.com','1173289264@qq.com',\
    # '756670951@qq.com','maric_downyxu@163.com'           ]
    print(outStr)
    for item in sendlist:
        email(item, outStr)
        print(item, '   go')
    # try:
        
    # except as e :
        # print(e)
        # print('send failed', item)