import smtplib
from email.mime.text import MIMEText
from email.header import Header
from email.mime.text import MIMEText
from email.utils import formataddr
import time
import json
import pandas as pd
from datetime import datetime, timedelta
def daysAgo(inDate, days):
    oneyearago = datetime.strptime(inDate, '%Y-%m-%d') - timedelta(days=days)
    oneyearago = oneyearago.strftime('%Y-%m-%d')
    return oneyearago

def hangyeRead():
    df_industry=pd.read_csv('./data/stock_industry.csv')
    df_industry = df_industry[['code','code_name','industry']]
    industry_dic = {}
    for item in df_industry.values:
        industry_dic[item[0]] = item[1:3]

    return industry_dic

def getSTR():
    with open('./data2/out.json', 'r') as f:
        trade_list = json.load(fp=f)

    localtime = time.strftime("%Y-%m-%d", time.localtime())
    industry_dic = hangyeRead()
    send = []
    outStr = "代码 , 收盘日期 , 收盘价格 , 明日预测买卖方向 , 指标（越大越好), 股票名字, 所属板块\n"
    for item in trade_list:
        if daysAgo(localtime, 0) == item[1]:
            item += [industry_dic[item[0]][0], industry_dic[item[0]][1]]
            outStr += str(item)
            outStr += '\n' 
    outStr += "注意事项：\n \
                1.上午最佳卖出是早上开盘一冲高和11：00左右 (大盘高开10点前卖，低开等反弹在卖)。\n\
                2.上午最佳买入是大盘低开和10：00-10：30分左右。\n\
                3.下午最佳买入是2：00-2：30大家注意观察。\n\
                4.下午最佳卖出是13：10分-13：30分。\n\
                一定把我的这个邮箱设置为联系人，否则会进入到垃圾箱\
              "
    return outStr

def email(dstEmail, outStr):
    sender = '814123206@qq.com'
    localtime = time.strftime("%Y-%m-%d", time.localtime())
    smtp = smtplib.SMTP() 
    smtp.connect('smtp.qq.com',25) 
    smtp.login(sender, 'cyntatcmjvojbbdj') 

    msg=MIMEText(outStr,'plain','utf-8')
    msg['From']=formataddr(['魏旭鸿',sender])
    msg['To']=formataddr([dstEmail,dstEmail])
    msg['Subject']='在' + daysAgo(localtime, -1) + 'Asotck的操作'

    smtp.sendmail(sender, dstEmail, msg.as_string()) 
    smtp.quit()


if __name__ == "__main__":
    outStr = \
    '''
1 东阿阿胶 医药生物 20.0 亿利润, 价估:0.43 %
当前价格<2019-07-23:32.25元>,
买入估值参考: [29.83 30.95 32.08 33.2  34.32]
买入价格参考: [29.99 31.12 32.25 33.37 34.5 ]
买入平均参考: [29.91 31.03 32.16 33.29 34.41]
卖出估值保守: [48.89 50.73 52.57 54.41 56.25]
卖出价格保守: [47.43 49.21 51.   52.79 54.57]
卖出估值激进: [66.17 68.66 71.16 73.65 76.14]
五年平均杜邦ROE 23.28%
当前PETTM=11.31,(银行金融为PBTTM), peg:1.87
股息率2.79%,上次分红日期:2018-08-08
平均建仓参考: 34.42￥, 当前涨幅-6.30%
防御力(越大越好,优质股基准为90%):31.68% -防御性不高，行情不好不要买

2 天士力 医药生物 15.0 亿利润, 价估:0.57 %
当前价格<2019-07-23:16.13元>,
买入估值参考: [14.87 15.43 15.99 16.55 17.11]
买入价格参考: [14.7  15.25 15.81 16.36 16.92]
买入平均参考: [14.79 15.34 15.9  16.46 17.01]
卖出估值保守: [27.04 28.06 29.08 30.1  31.12]
卖出价格保守: [22.45 23.29 24.14 24.98 25.83]
卖出估值激进: [37.54 38.96 40.37 41.78 43.2 ]
五年平均杜邦ROE 20.70%
当前PETTM=15.10,(银行金融为PBTTM), peg:1.06
股息率1.86%,上次分红日期:2019-06-12
平均建仓参考: 17.02￥, 当前涨幅-5.19%
防御力(越大越好,优质股基准为90%):40.14% -防御性不高，行情不好不要买

3 亨通光电 通信 26.0 亿利润, 价估:1.08 %
当前价格<2019-07-23:15.48元>,
买入估值参考: [14.12 14.66 15.19 15.72 16.25]
买入价格参考: [14.16 14.7  15.23 15.76 16.3 ]
买入平均参考: [14.14 14.68 15.21 15.74 16.27]
卖出估值保守: [24.54 25.46 26.39 27.31 28.24]
卖出价格保守: [21.47 22.28 23.08 23.89 24.7 ]
卖出估值激进: [38.79 40.25 41.71 43.17 44.64]
五年平均杜邦ROE 19.34%
当前PETTM=11.89,(银行金融为PBTTM), peg:0.37
股息率0.97%,上次分红日期:2019-06-10
平均建仓参考: 16.28￥, 当前涨幅-4.91%
防御力(越大越好,优质股基准为90%):77.38% -防御性不高，行情不好不要买

4 新城控股 房地产 122.0 亿利润, 价估:0.00 %
当前价格<2019-07-23:27.87元>,
买入估值参考: [25.91 26.88 27.86 28.84 29.81]
买入价格参考: [23.63 24.52 25.41 26.3  27.19]
买入平均参考: [24.77 25.7  26.64 27.57 28.5 ]
卖出估值保守: [50.6  52.5  54.41 56.31 58.22]
卖出价格保守: [41.12 42.67 44.21 45.76 47.31]
卖出估值激进: [137.19 142.35 147.51 152.68 157.84]
五年平均杜邦ROE 29.16%
当前PETTM=5.84,(银行金融为PBTTM), peg:0.06
股息率5.38%,上次分红日期:2019-05-24
平均建仓参考: 28.51￥, 当前涨幅-2.25%
防御力(越大越好,优质股基准为90%):103.64%

5 双汇发展 食品饮料 50.0 亿利润, 价估:13.46 %
当前价格<2019-07-23:24.54元>,
买入估值参考: [21.24 22.04 22.84 23.64 24.44]
买入价格参考: [21.81 22.63 23.45 24.27 25.09]
买入平均参考: [21.52 22.33 23.14 23.95 24.77]
卖出估值保守: [25.85 26.82 27.79 28.77 29.74]
卖出价格保守: [25.31 26.27 27.22 28.17 29.13]
卖出估值激进: [32.91 34.15 35.39 36.63 37.86]
五年平均杜邦ROE 29.49%
当前PETTM=15.85,(银行金融为PBTTM), peg:2.89
股息率2.24%,上次分红日期:2019-04-19
平均建仓参考: 24.77￥, 当前涨幅-0.95%
防御力(越大越好,优质股基准为90%):106.95%

6 上汽集团 汽车 484.0 亿利润, 价估:9.16 %
当前价格<2019-07-23:23.72元>,
买入估值参考: [20.7  21.48 22.26 23.04 23.82]
买入价格参考: [20.52 21.3  22.07 22.84 23.61]
买入平均参考: [20.61 21.39 22.16 22.94 23.72]
卖出估值保守: [27.26 28.29 29.32 30.34 31.37]
卖出价格保守: [26.38 27.37 28.36 29.36 30.35]
卖出估值激进: [35.48 36.82 38.15 39.49 40.82]
五年平均杜邦ROE 17.29%
当前PETTM=8.08,(银行金融为PBTTM), peg:1.64
股息率5.31%,上次分红日期:2019-07-11
平均建仓参考: 23.72￥, 当前涨幅-0.00%
防御力(越大越好,优质股基准为90%):89.52% -防御性不高，行情不好不要买

7 福耀玻璃 汽车 41.0 亿利润, 价估:11.69 %
当前价格<2019-07-23:22.29元>,
买入估值参考: [18.57 19.27 19.97 20.67 21.37]
买入价格参考: [19.85 20.6  21.35 22.09 22.84]
买入平均参考: [19.21 19.94 20.66 21.38 22.11]
卖出估值保守: [27.35 28.38 29.41 30.44 31.47]
卖出价格保守: [24.44 25.36 26.28 27.2  28.12]
卖出估值激进: [36.93 38.32 39.71 41.1  42.49]
五年平均杜邦ROE 20.73%
当前PETTM=13.57,(银行金融为PBTTM), peg:0.95
股息率3.37%,上次分红日期:2019-05-28
平均建仓参考: 22.11￥, 当前涨幅0.79%
防御力(越大越好,优质股基准为90%):94.46%

8 大族激光 电子 17.0 亿利润, 价估:8.83 %
当前价格<2019-07-23:27.10元>,
买入估值参考: [21.12 21.91 22.71 23.5  24.29]
买入价格参考: [25.2  26.15 27.1  28.04 28.99]
买入平均参考: [23.16 24.03 24.9  25.77 26.64]
卖出估值保守: [39.9  41.4  42.9  44.41 45.91]
卖出价格保守: [41.29 42.85 44.4  45.96 47.51]
卖出估值激进: [67.36 69.9  72.43 74.97 77.51]
五年平均杜邦ROE 19.96%
当前PETTM=19.15,(银行金融为PBTTM), peg:0.37
股息率0.74%,上次分红日期:2019-05-29
平均建仓参考: 26.65￥, 当前涨幅1.69%
防御力(越大越好,优质股基准为90%):80.47% -防御性不高，行情不好不要买

9 济川药业 医药生物 16.0 亿利润, 价估:7.99 %
当前价格<2019-07-23:31.00元>,
买入估值参考: [25.53 26.49 27.45 28.41 29.38]
买入价格参考: [26.23 27.21 28.2  29.19 30.17]
买入平均参考: [25.88 26.85 27.83 28.8  29.78]
卖出估值保守: [46.33 48.07 49.82 51.56 53.3 ]
卖出价格保守: [33.93 35.21 36.49 37.77 39.04]
卖出估值激进: [66.7  69.21 71.72 74.23 76.74]
五年平均杜邦ROE 30.39%
当前PETTM=15.10,(银行金融为PBTTM), peg:0.44
股息率3.97%,上次分红日期:2019-05-31
平均建仓参考: 29.78￥, 当前涨幅4.08%
防御力(越大越好,优质股基准为90%):96.65%

10 宁沪高速 交通运输 44.0 亿利润, 价估:16.19 %
当前价格<2019-07-23:10.21元>,
买入估值参考: [8.36 8.68 8.99 9.31 9.62]
买入价格参考: [8.58 8.91 9.23 9.55 9.88]
买入平均参考: [8.47 8.79 9.11 9.43 9.75]
卖出估值保守: [10.37 10.76 11.15 11.54 11.94]
卖出价格保守: [ 9.82 10.19 10.56 10.93 11.3 ]
卖出估值激进: [15.3  15.88 16.46 17.03 17.61]
五年平均杜邦ROE 14.83%
当前PETTM=11.74,(银行金融为PBTTM), peg:0.83
股息率4.51%,上次分红日期:2019-07-11
平均建仓参考: 9.75￥, 当前涨幅4.63%
防御力(越大越好,优质股基准为90%):102.66%

11 保利地产 房地产 261.0 亿利润, 价估:1.31 %
当前价格<2019-07-23:14.38元>,
买入估值参考: [13.21 13.7  14.2  14.7  15.19]
买入价格参考: [10.59 10.99 11.39 11.79 12.19]
买入平均参考: [11.9  12.35 12.8  13.24 13.69]
卖出估值保守: [16.67 17.3  17.93 18.55 19.18]
卖出价格保守: [13.59 14.1  14.62 15.13 15.64]
卖出估值激进: [25.26 26.21 27.16 28.11 29.06]
五年平均杜邦ROE 17.61%
当前PETTM=7.48,(银行金融为PBTTM), peg:0.31
股息率3.48%,上次分红日期:2019-05-27
平均建仓参考: 13.70￥, 当前涨幅4.95%
防御力(越大越好,优质股基准为90%):101.85%

12 中国医药 医药生物 18.0 亿利润, 价估:5.01 %
当前价格<2019-07-23:13.40元>,
买入估值参考: [11.06 11.48 11.89 12.31 12.72]
买入价格参考: [11.07 11.49 11.9  12.32 12.74]
买入平均参考: [11.06 11.48 11.9  12.31 12.73]
卖出估值保守: [23.41 24.29 25.17 26.06 26.94]
卖出价格保守: [15.2  15.78 16.35 16.92 17.49]
卖出估值激进: [38.98 40.45 41.92 43.38 44.85]
五年平均杜邦ROE 15.43%
当前PETTM=9.46,(银行金融为PBTTM), peg:0.34
股息率3.24%,上次分红日期:2019-06-13
平均建仓参考: 12.73￥, 当前涨幅5.22%
防御力(越大越好,优质股基准为90%):33.81% -防御性不高，行情不好不要买

13 白云山 医药生物 35.0 亿利润, 价估:11.03 %
当前价格<2019-07-23:37.63元>,
买入估值参考: [30.22 31.35 32.49 33.63 34.76]
买入价格参考: [30.94 32.11 33.27 34.44 35.6 ]
买入平均参考: [30.58 31.73 32.88 34.03 35.18]
卖出估值保守: [50.66 52.57 54.48 56.38 58.29]
卖出价格保守: [41.17 42.72 44.27 45.82 47.37]
卖出估值激进: [73.5  76.27 79.03 81.8  84.57]
五年平均杜邦ROE 14.50%
当前PETTM=15.63,(银行金融为PBTTM), peg:0.31
股息率1.13%,上次分红日期:2019-07-10
平均建仓参考: 35.19￥, 当前涨幅6.94%
防御力(越大越好,优质股基准为90%):126.82%

14 桃李面包 食品饮料 6.0 亿利润, 价估:25.57 %
当前价格<2019-07-23:39.88元>,
买入估值参考: [32.07 33.28 34.49 35.69 36.9 ]
买入价格参考: [31.92 33.13 34.33 35.53 36.73]
买入平均参考: [32.   33.2  34.41 35.61 36.82]
卖出估值保守: [39.38 40.86 42.35 43.83 45.31]
卖出价格保守: [39.05 40.53 42.   43.47 44.94]
卖出估值激进: [51.69 53.63 55.58 57.52 59.47]
五年平均杜邦ROE 21.32%
当前PETTM=38.23,(银行金融为PBTTM), peg:1.78
股息率2.51%,上次分红日期:2019-04-24
平均建仓参考: 36.82￥, 当前涨幅8.32%
防御力(越大越好,优质股基准为90%):136.46%

15 片仔癀 医药生物 11.0 亿利润, 价估:16.90 %
当前价格<2019-07-23:101.80元>,
买入估值参考: [79.76 82.77 85.77 88.77 91.77]
买入价格参考: [81.3  84.36 87.42 90.48 93.54]
买入平均参考: [80.53 83.56 86.59 89.62 92.65]
卖出估值保守: [110.79 114.96 119.13 123.3  127.47]
卖出价格保守: [112.37 116.6  120.83 125.06 129.29]
卖出估值激进: [167.95 174.27 180.59 186.91 193.23]
五年平均杜邦ROE 18.77%
当前PETTM=48.69,(银行金融为PBTTM), peg:0.99
股息率0.59%,上次分红日期:2019-06-26
平均建仓参考: 92.66￥, 当前涨幅9.86%
防御力(越大越好,优质股基准为90%):131.57% pe过45，不建议买入

16 海康威视 电子 113.0 亿利润, 价估:14.81 %
当前价格<2019-07-23:28.77元>,
买入估值参考: [22.51 23.35 24.2  25.05 25.89]
买入价格参考: [22.32 23.16 24.01 24.85 25.69]
买入平均参考: [22.41 23.26 24.1  24.95 25.79]
卖出估值保守: [35.75 37.09 38.44 39.79 41.13]
卖出价格保守: [33.34 34.59 35.85 37.1  38.36]
卖出估值激进: [51.17 53.1  55.03 56.95 58.88]
五年平均杜邦ROE 34.45%
当前PETTM=23.78,(银行金融为PBTTM), peg:1.00
股息率2.09%,上次分红日期:2019-05-23
平均建仓参考: 25.79￥, 当前涨幅11.53%
防御力(越大越好,优质股基准为90%):84.46% -防御性不高，行情不好不要买

17 海尔智家 家用电器 97.0 亿利润, 价估:35.44 %
当前价格<2019-07-23:16.56元>,
买入估值参考: [11.59 12.03 12.46 12.9  13.34]
买入价格参考: [13.9  14.43 14.95 15.47 16.  ]
买入平均参考: [12.75 13.23 13.71 14.19 14.67]
卖出估值保守: [16.55 17.17 17.79 18.42 19.04]
卖出价格保守: [17.38 18.03 18.68 19.34 19.99]
卖出估值激进: [22.34 23.18 24.02 24.86 25.7 ]
五年平均杜邦ROE 22.35%
当前PETTM=13.95,(银行金融为PBTTM), peg:0.67
股息率2.06%,上次分红日期:2018-06-06
平均建仓参考: 14.67￥, 当前涨幅12.90%
防御力(越大越好,优质股基准为90%):91.67%

18 华夏幸福 房地产 118.0 亿利润, 价估:9.09 %
当前价格<2019-07-23:30.45元>,
买入估值参考: [23.31 24.18 25.06 25.94 26.81]
买入价格参考: [22.95 23.82 24.68 25.54 26.41]
买入平均参考: [23.13 24.   24.87 25.74 26.61]
卖出估值保守: [40.9  42.44 43.98 45.52 47.06]
卖出价格保守: [30.77 31.93 33.09 34.25 35.41]
卖出估值激进: [78.45 81.4  84.36 87.31 90.26]
五年平均杜邦ROE 34.95%
当前PETTM=7.29,(银行金融为PBTTM), peg:0.19
股息率3.94%,上次分红日期:2019-07-11
平均建仓参考: 26.62￥, 当前涨幅14.42%
防御力(越大越好,优质股基准为90%):49.02% -防御性不高，行情不好不要买

19 华帝股份 家用电器 6.0 亿利润, 价估:8.33 %
当前价格<2019-07-23:11.43元>,
买入估值参考: [8.53 8.85 9.17 9.49 9.81]
买入价格参考: [8.6  8.93 9.25 9.58 9.9 ]
买入平均参考: [8.57 8.89 9.21 9.53 9.86]
卖出估值保守: [19.87 20.62 21.36 22.11 22.86]
卖出价格保守: [14.55 15.09 15.64 16.19 16.74]
卖出估值激进: [33.69 34.96 36.22 37.49 38.76]
五年平均杜邦ROE 21.82%
当前PETTM=14.58,(银行金融为PBTTM), peg:0.34
股息率2.62%,上次分红日期:2019-06-21
平均建仓参考: 9.86￥, 当前涨幅15.91%
防御力(越大越好,优质股基准为90%):51.30% -防御性不高，行情不好不要买

20 华润三九 医药生物 14.0 亿利润, 价估:14.69 %
当前价格<2019-07-23:29.25元>,
买入估值参考: [23.16 24.03 24.9  25.77 26.64]
买入价格参考: [20.62 21.39 22.17 22.95 23.72]
买入平均参考: [21.89 22.71 23.53 24.36 25.18]
卖出估值保守: [39.17 40.64 42.12 43.59 45.06]
卖出价格保守: [28.98 30.07 31.17 32.26 33.35]
卖出估值激进: [50.69 52.6  54.51 56.42 58.32]
五年平均杜邦ROE 15.25%
当前PETTM=13.25,(银行金融为PBTTM), peg:1.26
股息率1.57%,上次分红日期:2018-06-20
平均建仓参考: 25.19￥, 当前涨幅16.15%
防御力(越大越好,优质股基准为90%):55.35% -防御性不高，行情不好不要买

21 华鲁恒升 化工 30.0 亿利润, 价估:7.93 %
当前价格<2019-07-23:14.45元>,
买入估值参考: [10.4  10.79 11.18 11.57 11.97]
买入价格参考: [11.21 11.63 12.05 12.47 12.9 ]
买入平均参考: [10.8  11.21 11.62 12.02 12.43]
卖出估值保守: [26.65 27.65 28.66 29.66 30.66]
卖出价格保守: [16.96 17.6  18.23 18.87 19.51]
卖出估值激进: [48.62 50.45 52.28 54.11 55.94]
五年平均杜邦ROE 15.88%
当前PETTM=8.11,(银行金融为PBTTM), peg:0.09
股息率1.38%,上次分红日期:2019-06-12
平均建仓参考: 12.44￥, 当前涨幅16.16%
防御力(越大越好,优质股基准为90%):104.39%

22 涪陵榨菜 食品饮料 6.0 亿利润, 价估:24.72 %
当前价格<2019-07-23:26.84元>,
买入估值参考: [19.52 20.25 20.99 21.72 22.46]
买入价格参考: [20.59 21.37 22.14 22.92 23.69]
买入平均参考: [20.06 20.81 21.57 22.32 23.08]
卖出估值保守: [28.52 29.59 30.67 31.74 32.81]
卖出价格保守: [28.81 29.89 30.98 32.06 33.14]
卖出估值激进: [41.53 43.09 44.66 46.22 47.78]
五年平均杜邦ROE 19.18%
当前PETTM=30.36,(银行金融为PBTTM), peg:0.50
股息率0.97%,上次分红日期:2019-06-17
平均建仓参考: 23.08￥, 当前涨幅16.31%
防御力(越大越好,优质股基准为90%):133.30%

23 万科A 房地产 492.0 亿利润, 价估:20.69 %
当前价格<2019-07-23:30.31元>,
买入估值参考: [21.5  22.31 23.12 23.93 24.74]
买入价格参考: [23.46 24.35 25.23 26.11 27.  ]
买入平均参考: [22.48 23.33 24.18 25.02 25.87]
卖出估值保守: [31.54 32.72 33.91 35.1  36.28]
卖出价格保守: [30.5  31.65 32.79 33.94 35.09]
卖出估值激进: [53.81 55.83 57.86 59.89 61.91]
五年平均杜邦ROE 20.84%
当前PETTM=9.97,(银行金融为PBTTM), peg:0.31
股息率2.97%,上次分红日期:2018-08-22
平均建仓参考: 25.87￥, 当前涨幅17.16%
防御力(越大越好,优质股基准为90%):91.53%

24 华东医药 医药生物 23.0 亿利润, 价估:16.25 %
当前价格<2019-07-23:28.02元>,
买入估值参考: [20.94 21.73 22.51 23.3  24.09]
买入价格参考: [20.22 20.98 21.74 22.5  23.26]
买入平均参考: [20.58 21.35 22.13 22.9  23.68]
卖出估值保守: [37.11 38.51 39.9  41.3  42.7 ]
卖出价格保守: [28.37 29.44 30.5  31.57 32.64]
卖出估值激进: [52.41 54.39 56.36 58.33 60.3 ]
五年平均杜邦ROE 29.76%
当前PETTM=19.76,(银行金融为PBTTM), peg:0.79
股息率1.18%,上次分红日期:2019-06-20
平均建仓参考: 23.68￥, 当前涨幅18.32%
防御力(越大越好,优质股基准为90%):102.89%

25 海螺水泥 建筑材料 306.0 亿利润, 价估:12.29 %
当前价格<2019-07-23:40.33元>,
买入估值参考: [30.62 31.77 32.93 34.08 35.23]
买入价格参考: [27.32 28.35 29.38 30.41 31.44]
买入平均参考: [28.97 30.06 31.15 32.24 33.33]
卖出估值保守: [56.05 58.16 60.26 62.37 64.48]
卖出价格保守: [40.06 41.57 43.08 44.59 46.1 ]
卖出估值激进: [86.62 89.88 93.14 96.4  99.66]
五年平均杜邦ROE 17.83%
当前PETTM=6.85,(银行金融为PBTTM), peg:0.08
股息率4.19%,上次分红日期:2019-06-18
平均建仓参考: 33.34￥, 当前涨幅20.97%
防御力(越大越好,优质股基准为90%):123.21%

26 华兰生物 医药生物 12.0 亿利润, 价估:42.81 %
当前价格<2019-07-23:30.89元>,
买入估值参考: [22.81 23.67 24.53 25.38 26.24]
买入价格参考: [20.34 21.1  21.87 22.64 23.4 ]
买入平均参考: [21.57 22.39 23.2  24.01 24.82]
卖出估值保守: [28.48 29.55 30.62 31.69 32.77]
卖出价格保守: [30.12 31.26 32.39 33.52 34.66]
卖出估值激进: [36.62 38.   39.38 40.76 42.14]
五年平均杜邦ROE 18.79%
当前PETTM=36.42,(银行金融为PBTTM), peg:1.44
股息率1.29%,上次分红日期:2019-06-14
平均建仓参考: 24.83￥, 当前涨幅24.42%
防御力(越大越好,优质股基准为90%):131.46%

27 洋河股份 食品饮料 81.0 亿利润, 价估:34.31 %
当前价格<2019-07-23:123.92元>,
买入估值参考: [85.47 88.68 91.9  95.12 98.33]
买入价格参考: [85.94 89.17 92.41 95.64 98.88]
买入平均参考: [85.7  88.93 92.15 95.38 98.6 ]
卖出估值保守: [124.3  128.98 133.66 138.34 143.01]
卖出价格保守: [125.08 129.79 134.5  139.2  143.91]
卖出估值激进: [172.27 178.75 185.24 191.72 198.2 ]
五年平均杜邦ROE 24.56%
当前PETTM=21.32,(银行金融为PBTTM), peg:1.17
股息率2.58%,上次分红日期:2019-06-26
平均建仓参考: 98.61￥, 当前涨幅25.67%
防御力(越大越好,优质股基准为90%):106.79%

28 安琪酵母 农林牧渔 8.0 亿利润, 价估:52.03 %
当前价格<2019-07-23:28.88元>,
买入估值参考: [17.22 17.87 18.52 19.17 19.82]
买入价格参考: [22.46 23.31 24.16 25.   25.85]
买入平均参考: [19.84 20.59 21.34 22.09 22.83]
卖出估值保守: [26.91 27.92 28.94 29.95 30.96]
卖出价格保守: [30.46 31.61 32.76 33.9  35.05]
卖出估值激进: [35.72 37.07 38.41 39.76 41.1 ]
五年平均杜邦ROE 15.36%
当前PETTM=29.59,(银行金融为PBTTM), peg:1.19
股息率1.21%,上次分红日期:2019-06-03
平均建仓参考: 22.84￥, 当前涨幅26.44%
防御力(越大越好,优质股基准为90%):100.28%

29 晨光文具 轻工制造 8.0 亿利润, 价估:65.14 %
当前价格<2019-07-23:38.31元>,
买入估值参考: [25.25 26.2  27.15 28.1  29.05]
买入价格参考: [27.23 28.26 29.28 30.31 31.33]
买入平均参考: [26.24 27.23 28.22 29.21 30.19]
卖出估值保守: [32.37 33.59 34.81 36.03 37.25]
卖出价格保守: [41.16 42.71 44.26 45.81 47.36]
卖出估值激进: [41.18 42.73 44.28 45.83 47.38]
五年平均杜邦ROE 25.61%
当前PETTM=41.00,(银行金融为PBTTM), peg:1.39
股息率0.78%,上次分红日期:2019-05-06
平均建仓参考: 30.20￥, 当前涨幅26.88%
防御力(越大越好,优质股基准为90%):131.60%

30 美的集团 家用电器 216.0 亿利润, 价估:45.28 %
当前价格<2019-07-23:52.97元>,
买入估值参考: [33.65 34.91 36.18 37.45 38.71]
买入价格参考: [37.5  38.92 40.33 41.74 43.15]
买入平均参考: [35.58 36.91 38.25 39.59 40.93]
卖出估值保守: [48.3  50.12 51.94 53.76 55.57]
卖出价格保守: [50.83 52.75 54.66 56.57 58.49]
卖出估值激进: [68.11 70.68 73.24 75.8  78.37]
五年平均杜邦ROE 27.15%
当前PETTM=17.49,(银行金融为PBTTM), peg:1.04
股息率2.46%,上次分红日期:2019-05-29
平均建仓参考: 40.94￥, 当前涨幅29.38%
防御力(越大越好,优质股基准为90%):92.25%

31 洽洽食品 食品饮料 4.0 亿利润, 价估:85.65 %
当前价格<2019-07-23:26.27元>,
买入估值参考: [16.68 17.31 17.94 18.56 19.19]
买入价格参考: [17.93 18.61 19.28 19.96 20.63]
买入平均参考: [17.31 17.96 18.61 19.26 19.91]
卖出估值保守: [20.43 21.2  21.97 22.73 23.5 ]
卖出价格保守: [24.82 25.75 26.69 27.62 28.55]
卖出估值激进: [25.72 26.69 27.66 28.63 29.6 ]
五年平均杜邦ROE 12.08%
当前PETTM=29.03,(银行金融为PBTTM), peg:2.66
股息率1.90%,上次分红日期:2019-05-30
平均建仓参考: 19.92￥, 当前涨幅31.90%
防御力(越大越好,优质股基准为90%):133.26%

32 宁波银行 银行 112.0 亿利润, 价估:51.33 %
当前价格<2019-07-23:23.50元>,
买入估值参考: [17.07 17.25 17.42 17.59 17.77]
买入价格参考: [16.27 16.44 16.6  16.77 16.94]
买入平均参考: [16.67 16.84 17.01 17.18 17.35]
卖出估值保守: [21.33 21.55 21.77 21.99 22.21]
卖出价格保守: [23.86 24.1  24.34 24.59 24.83]
卖出估值激进: [28.67 28.96 29.25 29.55 29.84]
五年平均杜邦ROE 17.09%
当前PETTM=1.79,(银行金融为PBTTM), peg:0.09
股息率1.70%,上次分红日期:2019-07-09
平均建仓参考: 17.36￥, 当前涨幅35.39%
防御力(越大越好,优质股基准为90%):103.77%

33 贵州茅台 食品饮料 378.0 亿利润, 价估:48.27 %
当前价格<2019-07-23:953.23元>,
买入估值参考: [602.61 625.29 647.96 670.64 693.32]
买入价格参考: [612.92 635.98 659.05 682.12 705.18]
买入平均参考: [607.76 630.63 653.51 676.38 699.25]
卖出估值保守: [ 895.87  929.58  963.3   997.02 1030.73]
卖出价格保守: [ 951.15  986.95 1022.75 1058.54 1094.34]
卖出估值激进: [1190.73 1235.54 1280.36 1325.17 1369.98]
五年平均杜邦ROE 30.05%
当前PETTM=30.42,(银行金融为PBTTM), peg:0.67
股息率1.53%,上次分红日期:2019-06-27
平均建仓参考: 699.26￥, 当前涨幅36.32%
防御力(越大越好,优质股基准为90%):113.90%

34 恒瑞医药 医药生物 40.0 亿利润, 价估:50.80 %
当前价格<2019-07-23:66.31元>,
买入估值参考: [40.37 41.88 43.4  44.92 46.44]
买入价格参考: [43.27 44.9  46.53 48.16 49.79]
买入平均参考: [41.82 43.39 44.97 46.54 48.11]
卖出估值保守: [57.48 59.64 61.81 63.97 66.13]
卖出价格保守: [64.34 66.76 69.18 71.6  74.02]
卖出估值激进: [82.28 85.38 88.48 91.57 94.67]
五年平均杜邦ROE 23.01%
当前PETTM=67.80,(银行金融为PBTTM), peg:2.81
股息率0.33%,上次分红日期:2019-03-27
平均建仓参考: 48.12￥, 当前涨幅37.79%
防御力(越大越好,优质股基准为90%):123.68% pe过45，不建议买入

35 苏泊尔 家用电器 16.0 亿利润, 价估:68.13 %
当前价格<2019-07-23:68.22元>,
买入估值参考: [40.11 41.62 43.13 44.64 46.15]
买入价格参考: [45.63 47.34 49.06 50.78 52.5 ]
买入平均参考: [42.87 44.48 46.09 47.71 49.32]
卖出估值保守: [55.53 57.62 59.71 61.8  63.89]
卖出价格保守: [72.03 74.74 77.45 80.16 82.87]
卖出估值激进: [74.36 77.16 79.96 82.75 85.55]
五年平均杜邦ROE 24.41%
当前PETTM=32.49,(银行金融为PBTTM), peg:1.52
股息率1.50%,上次分红日期:2019-05-23
平均建仓参考: 49.33￥, 当前涨幅38.31%
防御力(越大越好,优质股基准为90%):130.32%

36 伊利股份 食品饮料 64.0 亿利润, 价估:69.10 %
当前价格<2019-07-23:32.14元>,
买入估值参考: [18.3  18.99 19.68 20.37 21.06]
买入价格参考: [21.73 22.55 23.37 24.19 25.  ]
买入平均参考: [20.02 20.77 21.52 22.28 23.03]
卖出估值保守: [26.09 27.07 28.05 29.03 30.02]
卖出价格保守: [31.94 33.14 34.34 35.54 36.74]
卖出估值激进: [35.07 36.39 37.71 39.03 40.35]
五年平均杜邦ROE 24.67%
当前PETTM=29.59,(银行金融为PBTTM), peg:4.43
股息率2.18%,上次分红日期:2019-04-04
平均建仓参考: 23.04￥, 当前涨幅39.55%
防御力(越大越好,优质股基准为90%):95.09%

37 益丰药房 医药生物 4.0 亿利润, 价估:47.72 %
当前价格<2019-07-23:66.59元>,
买入估值参考: [41.9  43.48 45.05 46.63 48.21]
买入价格参考: [40.78 42.31 43.85 45.38 46.92]
买入平均参考: [41.34 42.89 44.45 46.01 47.56]
卖出估值保守: [59.67 61.92 64.16 66.41 68.65]
卖出价格保守: [66.49 69.   71.5  74.   76.51]
卖出估值激进: [83.87 87.03 90.18 93.34 96.5 ]
五年平均杜邦ROE 12.39%
当前PETTM=54.38,(银行金融为PBTTM), peg:1.39
股息率0.45%,上次分红日期:2019-06-05
平均建仓参考: 47.57￥, 当前涨幅40.00%
防御力(越大越好,优质股基准为90%):121.88% pe过45，不建议买入

38 格力电器 家用电器 263.0 亿利润, 价估:48.35 %
当前价格<2019-07-23:54.11元>,
买入估值参考: [30.92 32.08 33.25 34.41 35.58]
买入价格参考: [35.75 37.1  38.44 39.79 41.14]
买入平均参考: [33.34 34.59 35.85 37.1  38.36]
卖出估值保守: [49.03 50.88 52.73 54.57 56.42]
卖出价格保守: [58.2  60.39 62.58 64.77 66.96]
卖出估值激进: [71.03 73.7  76.37 79.05 81.72]
五年平均杜邦ROE 32.92%
当前PETTM=12.45,(银行金融为PBTTM), peg:0.41
股息率1.11%,上次分红日期:2019-02-22
平均建仓参考: 38.36￥, 当前涨幅41.04%
防御力(越大越好,优质股基准为90%):97.02%

39 招商银行 银行 808.0 亿利润, 价估:66.97 %
当前价格<2019-07-23:36.25元>,
买入估值参考: [23.26 23.5  23.74 23.98 24.21]
买入价格参考: [25.92 26.19 26.45 26.72 26.98]
买入平均参考: [24.59 24.84 25.1  25.35 25.6 ]
卖出估值保守: [31.81 32.13 32.45 32.78 33.1 ]
卖出价格保守: [36.26 36.63 37.   37.37 37.74]
卖出估值激进: [41.57 42.   42.42 42.84 43.27]
五年平均杜邦ROE 16.87%
当前PETTM=1.72,(银行金融为PBTTM), peg:0.12
股息率2.59%,上次分红日期:2019-07-11
平均建仓参考: 25.60￥, 当前涨幅41.61%
防御力(越大越好,优质股基准为90%):110.70%

40 爱尔眼科 医药生物 10.0 亿利润, 价估:60.86 %
当前价格<2019-07-23:29.88元>,
买入估值参考: [17.39 18.04 18.7  19.35 20.01]
买入价格参考: [18.86 19.57 20.28 20.99 21.7 ]
买入平均参考: [18.12 18.81 19.49 20.17 20.85]
卖出估值保守: [23.55 24.44 25.33 26.21 27.1 ]
卖出价格保守: [29.59 30.71 31.82 32.93 34.05]
卖出估值激进: [34.46 35.76 37.06 38.35 39.65]
五年平均杜邦ROE 18.95%
当前PETTM=85.29,(银行金融为PBTTM), peg:2.30
股息率0.67%,上次分红日期:2019-06-04
平均建仓参考: 20.86￥, 当前涨幅43.23%
防御力(越大越好,优质股基准为90%):139.72% pe过45，不建议买入

41 中国平安 非银金融 1204.0 亿利润, 价估:65.19 %
当前价格<2019-07-23:87.65元>,
买入估值参考: [50.53 52.43 54.34 56.24 58.14]
买入价格参考: [54.89 56.95 59.02 61.08 63.15]
买入平均参考: [52.71 54.69 56.68 58.66 60.64]
卖出估值保守: [71.77 74.48 77.18 79.88 82.58]
卖出价格保守: [85.12 88.33 91.53 94.73 97.94]
卖出估值激进: [ 98.05 101.74 105.43 109.12 112.81]
五年平均杜邦ROE 18.61%
当前PETTM=2.67,(银行金融为PBTTM), peg:0.09
股息率1.25%,上次分红日期:2019-05-22
平均建仓参考: 60.65￥, 当前涨幅44.52%
防御力(越大越好,优质股基准为90%):108.80%

42 中国国旅 休闲服务 39.0 亿利润, 价估:60.33 %
当前价格<2019-07-23:86.80元>,
买入估值参考: [51.18 53.11 55.03 56.96 58.88]
买入价格参考: [49.98 51.86 53.75 55.63 57.51]
买入平均参考: [50.58 52.48 54.39 56.29 58.2 ]
卖出估值保守: [74.06 76.85 79.63 82.42 85.21]
卖出价格保守: [84.02 87.18 90.34 93.5  96.66]
卖出估值激进: [100.14 103.91 107.68 111.45 115.22]
五年平均杜邦ROE 16.83%
当前PETTM=39.66,(银行金融为PBTTM), peg:1.02
股息率0.63%,上次分红日期:2019-06-21
平均建仓参考: 58.20￥, 当前涨幅49.14%
防御力(越大越好,优质股基准为90%):133.56%

43 口子窖 食品饮料 15.0 亿利润, 价估:42.05 %
当前价格<2019-07-23:61.27元>,
买入估值参考: [35.54 36.87 38.21 39.55 40.89]
买入价格参考: [35.69 37.03 38.37 39.72 41.06]
买入平均参考: [35.61 36.95 38.29 39.63 40.97]
卖出估值保守: [63.56 65.96 68.35 70.74 73.13]
卖出价格保守: [61.92 64.25 66.58 68.91 71.24]
卖出估值激进: [86.54 89.79 93.05 96.31 99.56]
五年平均杜邦ROE 22.83%
当前PETTM=22.65,(银行金融为PBTTM), peg:0.57
股息率2.45%,上次分红日期:2019-05-28
平均建仓参考: 40.98￥, 当前涨幅49.53%
防御力(越大越好,优质股基准为90%):95.86%

44 海天味业 食品饮料 43.0 亿利润, 价估:85.64 %
当前价格<2019-07-23:100.79元>,
买入估值参考: [47.74 49.54 51.33 53.13 54.93]
买入价格参考: [66.26 68.76 71.25 73.75 76.24]
买入平均参考: [57.   59.15 61.29 63.44 65.58]
卖出估值保守: [71.59 74.28 76.97 79.67 82.36]
卖出价格保守: [ 99.89 103.65 107.41 111.16 114.92]
卖出估值激进: [101.44 105.26 109.08 112.89 116.71]
五年平均杜邦ROE 32.88%
当前PETTM=58.38,(银行金融为PBTTM), peg:2.44
股息率0.97%,上次分红日期:2019-05-06
平均建仓参考: 65.59￥, 当前涨幅53.67%
防御力(越大越好,优质股基准为90%):133.27% pe过45，不建议买入

45 今世缘 食品饮料 11.0 亿利润, 价估:65.26 %
当前价格<2019-07-23:26.95元>,
买入估值参考: [14.28 14.82 15.36 15.9  16.43]
买入价格参考: [15.2  15.77 16.34 16.92 17.49]
买入平均参考: [14.74 15.3  15.85 16.41 16.96]
卖出估值保守: [21.33 22.13 22.93 23.73 24.54]
卖出价格保守: [27.42 28.45 29.49 30.52 31.55]
卖出估值激进: [30.79 31.95 33.11 34.27 35.42]
五年平均杜邦ROE 19.21%
当前PETTM=26.33,(银行金融为PBTTM), peg:1.12
股息率1.22%,上次分红日期:2019-05-20
平均建仓参考: 16.97￥, 当前涨幅58.82%
防御力(越大越好,优质股基准为90%):113.38%

46 恒顺醋业 食品饮料 3.0 亿利润, 价估:74.78 %
当前价格<2019-07-23:16.49元>,
买入估值参考: [7.26 7.54 7.81 8.08 8.36]
买入价格参考: [10.35 10.74 11.13 11.52 11.91]
买入平均参考: [ 8.81  9.14  9.47  9.8  10.13]
卖出估值保守: [11.76 12.2  12.64 13.09 13.53]
卖出价格保守: [17.92 18.6  19.27 19.95 20.62]
卖出估值激进: [18.06 18.74 19.42 20.1  20.78]
五年平均杜邦ROE 13.91%
当前PETTM=41.44,(银行金融为PBTTM), peg:1.21
股息率0.73%,上次分红日期:2019-07-04
平均建仓参考: 10.14￥, 当前涨幅62.71%
防御力(越大越好,优质股基准为90%):124.56%

47 山西汾酒 食品饮料 15.0 亿利润, 价估:43.25 %
当前价格<2019-07-23:67.25元>,
买入估值参考: [33.23 34.48 35.73 36.98 38.23]
买入价格参考: [34.46 35.76 37.06 38.35 39.65]
买入平均参考: [33.85 35.12 36.39 37.67 38.94]
卖出估值保守: [68.21 70.77 73.34 75.91 78.48]
卖出价格保守: [66.49 68.99 71.5  74.   76.5 ]
卖出估值激进: [101.01 104.81 108.61 112.41 116.21]
五年平均杜邦ROE 15.88%
当前PETTM=36.56,(银行金融为PBTTM), peg:0.65
股息率0.89%,上次分红日期:2018-08-16
平均建仓参考: 38.95￥, 当前涨幅72.69%
防御力(越大越好,优质股基准为90%):92.37%

48 古井贡酒 食品饮料 17.0 亿利润, 价估:68.30 %
当前价格<2019-07-23:116.56元>,
买入估值参考: [55.61 57.71 59.8  61.89 63.99]
买入价格参考: [57.16 59.31 61.47 63.62 65.77]
买入平均参考: [56.39 58.51 60.63 62.75 64.88]
卖出估值保守: [101.01 104.81 108.61 112.41 116.21]
卖出价格保守: [114.99 119.32 123.65 127.97 132.3 ]
卖出估值激进: [132.9  137.91 142.91 147.91 152.91]
五年平均杜邦ROE 18.01%
当前PETTM=31.05,(银行金融为PBTTM), peg:0.72
股息率1.29%,上次分红日期:2019-06-20
平均建仓参考: 64.88￥, 当前涨幅79.66%
防御力(越大越好,优质股基准为90%):115.71%

49 五粮液 食品饮料 140.0 亿利润, 价估:64.34 %
当前价格<2019-07-23:121.23元>,
买入估值参考: [54.41 56.46 58.5  60.55 62.6 ]
买入价格参考: [50.34 52.23 54.12 56.02 57.91]
买入平均参考: [52.37 54.34 56.31 58.29 60.26]
卖出估值保守: [ 94.38  97.93 101.48 105.04 108.59]
卖出价格保守: [118.24 122.69 127.15 131.6  136.05]
卖出估值激进: [145.07 150.53 155.98 161.44 166.9 ]
五年平均杜邦ROE 17.51%
当前PETTM=31.30,(银行金融为PBTTM), peg:0.76
股息率1.40%,上次分红日期:2019-06-05
平均建仓参考: 60.26￥, 当前涨幅101.17%
防御力(越大越好,优质股基准为90%):101.50%
    '''

    outStr = """注意事项：\n \

""" \
              + outStr

    sendlist = ['big_weixuhong@qq.com']
    # , 'qiujtmaric@163.com','719253612@qq.com'\
    # ,'sunyixin610@126.com','364141009@qq.com','whitekreuz@163.com',\
    #            'zzhisheng@outlook.com','chenyf_sh@163.com', 'zhao129363@163.com','675988851@qq.com','1173289264@qq.com',\
    # '756670951@qq.com','maric_downyxu@163.com'           ]
    print(outStr)
    for item in sendlist:
        email(item, outStr)
        print(item, '   go')
    # try:
        
    # except as e :
        # print(e)
        # print('send failed', item)