import smtplib
from email.mime.text import MIMEText
from email.header import Header
from email.mime.text import MIMEText
from email.utils import formataddr
import time
import json
import pandas as pd
from datetime import datetime, timedelta
def daysAgo(inDate, days):
    oneyearago = datetime.strptime(inDate, '%Y-%m-%d') - timedelta(days=days)
    oneyearago = oneyearago.strftime('%Y-%m-%d')
    return oneyearago

def hangyeRead():
    df_industry=pd.read_csv('./data/stock_industry.csv')
    df_industry = df_industry[['code','code_name','industry']]
    industry_dic = {}
    for item in df_industry.values:
        industry_dic[item[0]] = item[1:3]

    return industry_dic

def getSTR():
    with open('./data2/out.json', 'r') as f:
        trade_list = json.load(fp=f)

    localtime = time.strftime("%Y-%m-%d", time.localtime())
    industry_dic = hangyeRead()
    send = []
    outStr = "代码 , 收盘日期 , 收盘价格 , 明日预测买卖方向 , 指标（越大越好), 股票名字, 所属板块\n"
    for item in trade_list:
        if daysAgo(localtime, 0) == item[1]:
            item += [industry_dic[item[0]][0], industry_dic[item[0]][1]]
            outStr += str(item)
            outStr += '\n' 
    outStr += "注意事项：\n \
                1.上午最佳卖出是早上开盘一冲高和11：00左右 (大盘高开10点前卖，低开等反弹在卖)。\n\
                2.上午最佳买入是大盘低开和10：00-10：30分左右。\n\
                3.下午最佳买入是2：00-2：30大家注意观察。\n\
                4.下午最佳卖出是13：10分-13：30分。\n\
                一定把我的这个邮箱设置为联系人，否则会进入到垃圾箱\
              "
    return outStr

def email(dstEmail, outStr):
    sender = '814123206@qq.com'
    localtime = time.strftime("%Y-%m-%d", time.localtime())
    smtp = smtplib.SMTP() 
    smtp.connect('smtp.qq.com',25) 
    smtp.login(sender, 'cyntatcmjvojbbdj') 

    msg=MIMEText(outStr,'plain','utf-8')
    msg['From']=formataddr(['魏旭鸿',sender])
    msg['To']=formataddr([dstEmail,dstEmail])
    msg['Subject']='在' + daysAgo(localtime, -1) + 'Asotck的操作'

    smtp.sendmail(sender, dstEmail, msg.as_string()) 
    smtp.quit()


if __name__ == "__main__":
    outStr = \
    '''
浦发银行 银行 565.0 亿 25.0 % 当前12.09,0.95更低买入9.80,正常低买入10.32,1.1倍稍高买入11.35 回归价格:0.9倍12.32~1倍13.69~1.1倍:15.06 股息率2.90%,2019-06-10 120日最低价格9.39,*1.05=9.86,*1.1=10.33 120日最高价格12.09

保利地产 房地产 261.0 亿 10.0 % 当前13.00,0.95更低买入11.23,正常低买入11.82,1.1倍稍高买入13.00 回归价格:0.9倍13.46~1倍14.96~1.1倍:16.45 股息率3.85%,2019-05-27 120日最低价格11.05,*1.05=11.60,*1.1=12.16 120日最高价格14.13

中国医药 医药生物 18.0 亿 5.0 % 当前13.46,0.95更低买入11.24,正常低买入11.84,1.1倍稍高买入13.02 回归价格:0.9倍23.31~1倍25.91~1.1倍:28.50 股息率3.22%,2019-06-13 120日最低价格11.72,*1.05=12.30,*1.1=12.89 120日最高价格16.35

国电南瑞 电气设备 44.0 亿 4.0 % 当前18.34,0.95更低买入16.21,正常低买入17.07,1.1倍稍高买入18.77 回归价格:0.9倍21.77~1倍24.19~1.1倍:26.61 股息率1.96%,2018-06-28 120日最低价格17.19,*1.05=18.05,*1.1=18.91 120日最高价格23.91

天士力 医药生物 15.0 亿 2.0 % 当前16.59,0.95更低买入15.15,正常低买入15.94,1.1倍稍高买入17.54 回归价格:0.9倍26.62~1倍29.58~1.1倍:32.53 股息率1.81%,2019-06-12 120日最低价格15.81,*1.05=16.60,*1.1=17.39 120日最高价格24.14

济川药业 医药生物 16.0 亿 2.0 % 当前29.29,0.95更低买入26.82,正常低买入28.23,1.1倍稍高买入31.06 回归价格:0.9倍47.10~1倍52.33~1.1倍:57.57 股息率4.20%,2019-05-31 120日最低价格28.20,*1.05=29.62,*1.1=31.03 120日最高价格36.49

海螺水泥 建筑材料 306.0 亿 12.0 % 当前40.08,0.95更低买入30.82,正常低买入32.44,1.1倍稍高买入35.69 回归价格:0.9倍54.70~1倍60.78~1.1倍:66.85 股息率4.22%,2019-06-18 120日最低价格26.72,*1.05=28.06,*1.1=29.39 120日最高价格41.99

福耀玻璃 汽车 41.0 亿 8.0 % 当前21.77,0.95更低买入19.06,正常低买入20.06,1.1倍稍高买入22.07 回归价格:0.9倍26.71~1倍29.68~1.1倍:32.65 股息率3.45%,2019-05-28 120日最低价格20.80,*1.05=21.84,*1.1=22.89 120日最高价格26.28

万科A 房地产 492.0 亿 16.0 % 当前28.04,0.95更低买入21.43,正常低买入22.56,1.1倍稍高买入24.81 回归价格:0.9倍29.98~1倍33.31~1.1倍:36.64 股息率3.21%,2018-08-22 120日最低价格23.70,*1.05=24.89,*1.1=26.08 120日最高价格32.80

潍柴动力 汽车 116.0 亿 20.0 % 当前12.46,0.95更低买入7.72,正常低买入8.13,1.1倍稍高买入8.94 回归价格:0.9倍13.12~1倍14.58~1.1倍:16.03 股息率2.01%,2018-07-30 120日最低价格7.52,*1.05=7.89,*1.1=8.27 120日最高价格14.01

东阿阿胶 医药生物 20.0 亿 10.0 % 当前38.97,0.95更低买入33.63,正常低买入35.40,1.1倍稍高买入38.94 回归价格:0.9倍47.77~1倍53.08~1.1倍:58.39 股息率2.31%,2018-08-08 120日最低价格38.54,*1.05=40.47,*1.1=42.39 120日最高价格51.00

双汇发展 食品饮料 50.0 亿 14.0 % 当前24.73,0.95更低买入21.72,正常低买入22.87,1.1倍稍高买入25.15 回归价格:0.9倍25.02~1倍27.80~1.1倍:30.58 股息率2.22%,2019-04-19 120日最低价格22.58,*1.05=23.70,*1.1=24.83 120日最高价格27.23

华东医药 医药生物 23.0 亿 5.0 % 当前29.20,0.95更低买入25.55,正常低买入26.90,1.1倍稍高买入29.59 回归价格:0.9倍43.36~1倍48.17~1.1倍:52.99 股息率1.13%,2019-06-20 120日最低价格23.64,*1.05=24.83,*1.1=26.01 120日最高价格37.02

海康威视 电子 113.0 亿 11.0 % 当前26.79,0.95更低买入22.22,正常低买入23.39,1.1倍稍高买入25.73 回归价格:0.9倍33.40~1倍37.11~1.1倍:40.82 股息率2.24%,2019-05-23 120日最低价格24.01,*1.05=25.21,*1.1=26.41 120日最高价格35.85


有可能进行的操作：
保利地产 房地产 261.0 亿 10.0 % 当前13.00,0.95更低买入11.23,正常低买入11.82,1.07倍稍高买入12.65 回归价格:0.9倍13.46~1倍14.96~1.07倍:16.00 股息率3.85%,2019-05-27 120日最低价格11.05,*1.05=11.60,*1.1=12.16 120日最高价格14.13

福耀玻璃 汽车 41.0 亿 8.0 % 当前21.77,0.95更低买入19.06,正常低买入20.06,1.07倍稍高买入21.47 回归价格:0.9倍26.71~1倍29.68~1.07倍:31.76 股息率3.45%,2019-05-28 120日最低价格20.80,*1.05=21.84,*1.1=22.89 120日最高价格26.28

东阿阿胶 医药生物 20.0 亿 10.0 % 当前38.97,0.95更低买入33.63,正常低买入35.40,1.07倍稍高买入37.87 回归价格:0.9倍47.77~1倍53.08~1.07倍:56.79 股息率2.31%,2018-08-08 120日最低价格38.54,*1.05=40.47,*1.1=42.39 120日最高价格51.00

双汇发展 食品饮料 50.0 亿 14.0 % 当前24.73,0.95更低买入21.72,正常低买入22.87,1.07倍稍高买入24.47 回归价格:0.9倍25.02~1倍27.80~1.07倍:29.74 股息率2.22%,2019-04-19 120日最低价格22.58,*1.05=23.70,*1.1=24.83 120日最高价格27.23

'''

    # outStr += "注意事项：\n \
    #             以上股票随便买，都是低估值，有钱就买，越便宜越买\
    #             1.上午最佳卖出是早上开盘一冲高和11：2200左右 (大盘高开10点前卖，低开等反弹在卖)。\n\
    #             2.上午最佳买入是大盘低开和10：00-10：30分左右。\n\
    #             3.下午最佳买入是2：00-2：30大家注意观察。\n\
    #             4.下午最佳卖出是13：10分-13：30分。\n\
    #             \
    #           "
    sendlist = ['big_weixuhong@qq.com']#, 'qiujtmaric@163.com']
    # ,'719253612@qq.com', 'qiujtmaric@163.com','sunyixin610@126.com','364141009@qq.com','whitekreuz@163.com',\
    #            'zzhisheng@outlook.com', 'qiujtmaric@163.com']
    print(outStr)
    for item in sendlist:
        email(item, outStr)
        print(item, '   go')
    # try:
        
    # except as e :
        # print(e)
        # print('send failed', item)